# DSE5002 Project 2
### Ryan Waterman

#### Import Libraries (Part 2.b)

In [1]:
from project_functions.connect import Connect
from project_functions.query import Query
from project_functions.transaction import Transaction
import os

#### Test Connection (Part 2.d)

Testing the connection with Pat's user information from the vault file:

In [2]:
test_conn = Connect()

path = os.path.join(os.getcwd(), r'data\vault.txt')

engine = test_conn.connect(path)

User: Pat successfully connected to bank!

In [3]:
test_query = Query(test_conn)

test_query.read_query("""
                        SELECT * 
                        FROM department
                    """
                    )

   dept_id            name trial104
0        1      Operations        T
1        2           Loans        T
2        3  Administration        T

#### Test Invalid Connection (Part 2.e)

Trying an invalid vault file name:

In [4]:
test_conn_invalid_vault = Connect()

invalid_path = os.path.join(os.getcwd(), r'data\vault1.txt')

engine = test_conn_invalid_vault.connect(invalid_path)

Error: [Errno 2] No such file or directory: 'c:\\Users\\water\\OneDrive\\GradSchool\\DSE5002_Project_2\\data\\vault1.txt'

#### Testing Transaction Database Connection (Part 3)

In [5]:
test_transaction = Transaction(test_conn)
test_transaction.retreive_transactions('01','2000')

,txn_id,txn_date,account_id,txn_type_cd,amount,teller_emp_id,execution_branch_id,funds_avail_date,trial104
0,1,2000-01-15,1,CDT,100.0,None,None,2000-01-15,T
1,2,2000-01-15,2,CDT,100.0,None,None,2000-01-15,T
2,9,2000-01-15,11,CDT,100.0,None,None,2000-01-15,T

In [6]:
test_transaction_invalid = Transaction(test_conn)
test_transaction.retreive_transactions('02','2000')

,txn_id,txn_date,account_id,txn_type_cd,amount,teller_emp_id,execution_branch_id,funds_avail_date,trial104
0,-1,-1,-1,-1,-1,-1,-1,-1,-1